Import numpy and pandas

In [1]:
import numpy as np
import pandas as pd

Create a python dictionary with 5 labels and 5 numbers of your choice.
Call it my_data.

In [2]:
my_data = {'January':31, 'February':28, 'March':31, 'April': 30, 'May':31}

Create a pandas Series from the my_data dictionary, called my_series.
Display it.

In [3]:
my_series = pd.Series(my_data)
my_series

January     31
February    28
March       31
April       30
May         31
dtype: int64

Create a 5x5 array of random integers, from 0 to 100 called nums.
Display it.

In [4]:
nums = np.random.randint(0,101,25).reshape(5,5)
nums

array([[ 0, 90, 63, 20, 86],
       [ 8, 99,  8, 20, 67],
       [47, 90,  1, 25, 27],
       [29, 27, 10, 22, 48],
       [84, 82, 71,  6, 82]])

Create a DataFrame from the nums array, called df.
Label the columns: A,B,C,D,E
Label the index: V,W,X,Y,Z
Display the DataFrame.

In [5]:
df = pd.DataFrame(nums, index=[ 'V','W','X','Y','Z'], columns=['A','B','C','D','E'])
df

    A   B   C   D   E
V   0  90  63  20  86
W   8  99   8  20  67
X  47  90   1  25  27
Y  29  27  10  22  48
Z  84  82  71   6  82

Display columns B and D.

In [6]:
df[['B','D']]

    B   D
V  90  20
W  99  20
X  90  25
Y  27  22
Z  82   6

Display rows X and Y.

In [7]:
df.loc[['X','Y']]

    A   B   C   D   E
X  47  90   1  25  27
Y  29  27  10  22  48

Display element YC.

In [8]:
df['C'].loc['Y']

10

Display rows X and Y, and columns B and D.

In [9]:
df[['B','D']].loc[['X','Y']]

    B   D
X  90  25
Y  27  22

Add a new column F, which is column A x column B.
Display the resulting DataFrame.

In [10]:
df['F'] = df['A']*df['B']
df

    A   B   C   D   E     F
V   0  90  63  20  86     0
W   8  99   8  20  67   792
X  47  90   1  25  27  4230
Y  29  27  10  22  48   783
Z  84  82  71   6  82  6888

Permanently drop row V and column F.
Display the resulting DataFrame.

In [11]:
df.drop(index='V', columns='F', inplace=True)
df

    A   B   C   D   E
W   8  99   8  20  67
X  47  90   1  25  27
Y  29  27  10  22  48
Z  84  82  71   6  82